Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: ཀུན་ཏུ་རྟོག་པ་ཀུན་སྤངས་ཀྱང་། །སྒྲིབ་པ་མེད་པའི་སྤྱོད་ཡུལ་ཅན། །རྣལ་འབྱོར་གཏོང་བའང་མ་ཡིན་ནོ། །
en: Though all concepts are entirely abandoned, The one in the domain of the unobscured Does not forsake the practice.

source: ཆོས་རྣམས་རང་འབྱུང་མ་ཡིན་ཏེ། །གང་གིས་ཀྱང་ནི་བསྒྲུབས་པ་མེད། །གྲངས་མེད་ཅིང་ནི་ཡི་གེ་མེད། །དེ་ནི་ནམ་མཁའ་འདྲ་བའི་མཚན། །
en: “Phenomena are not self-arisen, They are not effected by anything, They are incalculable and without words, And they have the quality of being like space.

source: ཆོས་འདི་རྟོགས་པར་ཁོང་ཆུད་ནས། །ཆོས་ཤེས་པ་ཡི་རྣལ་འབྱོར་ཅན། །མཉམ་པ་ཉིད་ལ་རབ་གནས་པ། །འཇུག་པ་མེད་ཅིང་ལྡོག་པའང་མེད། །
en: “Upon assimilating the realization of this teaching, A yogic practitioner who knows the Dharma And remains in equipoise Neither engages nor avoids.

source: གང་གིས་ཆོས་དྲན་འདི་འདྲ་སྟེ། །ཐམས་ཅད་ཆོས་ལས་མི་གཡོ་བ། །དེ་དག་ཕ་རོལ་ཕྱིན་པ་བརྟན། །སངས་རྒྱས་བསྟན་ལ་སྦྱིན་པ་སྦྱོང་། །
en: “Those who are mindful of the Dharma in this way, Who never stray from the Dharma, Are stable in the perfections And cultivate generosity toward the Buddha’s teaching.

source: སངས་རྒྱས་དོན་རྣམས་ཀུན་ལ་མཁས། །སྒྲིབ་པ་ཀུན་གྱི་དྲི་མ་མེད། །དཀར་པོ་ཐམས་ཅད་ཡང་དག་སྤྱོད། །སེམས་ཅན་ཀུན་ལ་ཕན་པར་བཞེད། །
en: “The Buddha is wise in all things, Untainted by any obscuration; He perfectly performs every wholesome deed, And wishes benefit for all beings.

source: རིགས་དང་གཟུགས་དང་ཡོན་ཏན་ལས། །རྫོགས་པའི་བྱང་ཆུབ་མཁས་པ་གང་། །ཡང་དག་དྲན་པ་དེ་དག་ནི། །དཀར་པོའི་ཆོས་ཀྱིས་རབ་ཏུ་རྒྱས། །
en: “Those of good lineage, appearance, qualities, and deeds, Who are wise about perfect awakening, And who are correctly mindful, Will develop further through the virtuous Dharma.

source: གང་ཞིག་རྟག་ཏུ་མཉམ་གཞག་ཅིང་། །ཆོས་ལ་དྲན་པ་མི་གཡེང་བ། །དེས་ནི་འདས་དང་མ་འོངས་པའི། །སངས་རྒྱས་ཐམས་ཅད་མཉེས་པར་བྱས། །
en: “One who is always in meditative composure, Undistracted from the mindfulness of phenomena, Gladdens all the buddhas Of both the past and the future.

source: དམ་པའི་ཆོས་ལ་བརྟེན་ཆོས་ཅན། །ཆོས་རྗེས་དྲན་པ་སྤྱོད་ཡུལ་བ། །བྱང་ཆུབ་སེམས་དཔའ་བརྟུལ་ཞུགས་བརྟན། །རྫོགས་པའི་བྱང་ཆུབ་རྟོགས་པར་འགྱུར། །
en: “One with the nature to rely on the sublime Dharma, Who has the scope to be mindful of phenomena, And who is firm in their bodhisattva commitments Will realize perfect awakening.

source: ཆོས་རྣམས་ཅི་འདྲ་དེ་བཞིན་དུ། །བདག་འགྱུར་སྙམ་དུ་གང་དྲན་པ། །བྱང་ཆུབ་སེམས་དཔའ་མཉམ་གཞག་དེས། །ཆོས་དྲན་པ་འདི་ཤེས་པར་བྱ། །
en: “The bodhisattva who is mindful, thinking, ‘Whatever phenomena are is what I am,’ And maintains meditative composure Will understand the mindfulness of phenomena.

source: ང་ཡི་མེད་ཅིང་ངར་འཛིན་མེད། །ཆོས་རྣམས་ཅི་འདྲ་དེ་ལྟར་བདག །
en: “ ‘There is no “I,” there is no “mine”; Whatever phenomena are is what I am.’

source: འགྱུར་རོ་སྙམ་དུ་དྲན་པ་ནི། །ཆོས་རྗེས་དྲན་པ་འདི་བསྒོམ་ཡིན། །
en: Being mindful while thinking this Is to cultivate the recollection of phenomena.

source: བླ་ན་མེད་པ་བསོད་ནམས་ཞིང་། །དགེ་འདུན་སངས་རྒྱས་སློབ་མ་རྣམས། །
en: “The saṅgha, the disciples of the Buddha, Are an unsurpassable field of merit.

source: སངས་རྒྱས་བྱང་ཆུབ་འགྱུར་བ་དག །རྟག་ཏུ་ཡང་དག་རྗེས་སུ་དྲན། །
en: Those who would awaken to buddhahood Always engage in correct recollection.

source: རྒྱ་མཚོ་ལྟ་བུར་དཔག་དཀའ་རྣམས། །བདག་གིས་རྗེས་སུ་དྲན་པ་ཡི། །བསོད་ནམས་རབ་ཏུ་གང་བསགས་དེས། །སེམས་ཅན་དེ་བཞིན་གཤེགས་གྱུར་ཅིག །མི་ལྡོག་ངང་ཚུལ་ཅན་རྣམས་ཀྱི། །
en: “By whatever merit I have amassed, Through the application of mindfulness That is as hard to fathom as the ocean, May beings become thus-gone ones!

source: ཚུལ་ཁྲིམས་ཡང་དག་རྗེས་དྲན་པ། །སེམས་ཅན་ཀུན་ལ་ཕན་སེམས་པ། །མཆོག་གི་བསོད་ནམས་གང་བསྐྱེད་པ། །སེམས་ཅན་རྣམས་ལ་ཕན་འདོད་ཕྱིར། །དེ་དག་རྫོགས་པའི་བྱང་ཆུབ་བསྔོ། །
en: “All the supreme merit generated By correct recollection of the discipline Demonstrated by those with an irreversible nature, And by the intention to benefit all beings, “I dedicate to perfect awakening, Out of a wish to benefit all beings.

source: སེམས་ཅན་ཀུན་ལ་ཕན་བྱེད་པ། །དེ་ནི་ཚུལ་ཁྲིམས་དྲན་ཞེས་བྱ། །
en: Acting to benefit all beings Is known as mindfulness of discipline.

source: ཟང་ཟིང་མེད་པས་ཆོས་བཏང་དང་། །ཉོན་མོངས་སྤངས་པའི་གང་དགེ་བ། །སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། །སྙིང་རྗེའི་བདག་ཉིད་སྔོ་བར་བྱེད། །
en: “In order to benefit all beings, I help those with a compassionate nature To dedicate the virtue of giving up afflictive emotions, And giving away phenomena out of disinterest.

source: གཏོང་བ་རྗེས་དྲན་ཕུན་སུམ་ཚོགས། །ཞིང་དང་སྐྱེ་ལ་རབ་གནས་པ། །མཚན་མ་མེད་ཅིང་རྩོལ་མེད་པར། །ཉི་མ་བཞིན་དུ་ཀུན་དུ་ཤར། །
en: “May the perfect recollection of giving, Present in every buddhafield and birth, Rise everywhere like the sun, Effortlessly and absent all features.

source: ལྷ་རྣམས་ཀུན་གྱི་དགེ་བ་གང་། །དགེ་བའི་ལས་ལས་རབ་བྱུང་བ། །བདེ་དེར་སེམས་ཅན་ཐམས་ཅད་ཕྱིར། །སྙིང་རྗེའི་བདག་ཉིད་དེ་ལྟར་འདོད། །
en: “Those with a compassionate nature aspire That all beings may experience the bliss Of the virtues known by all the gods, And that are born from virtuous deeds.

source: གང་གིས་འཇིག་རྟེན་ལྷར་གྱུར་ནས། །སངས་རྒྱས་བླ་ན་མེད་གྱུར་པ། །བདེ་བ་དེ་དག་རྟག་ཏུ་བྱ། །
en: “One should always cultivate the bliss, Of those who first became gods And then reached unsurpassable buddhahood.

source: བདག་གིས་དེ་ལྟ་དེ་ལྟར་བསྒྲུབ།། །།བམ་པོ་ལྔ་པ།
en: May I practice in precisely this way.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་དང་།
en: Then, both the bodhisattva great being Nirārambha and the bodhisattva great being Mativikrama approached the Blessed One.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྣམ་པར་གནོན་དང་གཉི་ག་གཡོག་དང་བཅས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ནས་ལྷགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: When they reached him, they bowed at the Blessed One’s feet and circled him many times, keeping him to their right.

source: ལན་དུ་མ་བསྐོར་བ་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་སྟེ།
en: They then sat to one side with the Blessed One’s permission.

source: གཡོག་དང་བཅས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གཉིས་འདིར་གཅིག་ཏུ་འདུས་ནས་ཆོས་ཡང་དག་པར་བརྗོད་པ་བགྱིས་ན།
en: Seated to one side along with their retinues, those two sublime beings said to the Blessed One, “Blessed One, the two of us came together here and discoursed on the Dharma.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མི་མཁྱེན་པའམ། མི་རིག་པའམ། རྣམ་པར་མི་མཁྱེན་པ་ཅུང་ཟད་ཀྱང་མི་མངའ་བ་ལགས་ན། བཅོམ་ལྡན་འདས་བདག་ཅག་གཉིས་ཀྱིས་ཆོས་ཡང་དག་པར་བརྗོད་པ་དང་འཐུན་པ་བགྱིས་པ་ལགས་སམ།
en: If there is not the slightest thing that the blessed buddhas do not know, do not understand, and do not discern, is what we have said in accord with your Dharma discourse?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་དེ་དེ་བཞིན་ཏེ།
en: The Blessed One said, “Children of good family, so it is.

source: ཇི་སྐད་སྨྲས་པ་དེ་ལྟའོ། །
en: What you said is correct.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མི་མཁྱེན་པའམ། མི་རིག་པའམ། རྣམ་པར་མི་མཁྱེན་པ་ཅུང་ཟད་ཙམ་ཡང་མི་མངའ་སྟེ།
en: There is not the slightest thing that the blessed buddhas do not know, do not understand, and do not discern.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཐམས་ཅད་དུ་སྒྲིབ་པ་མི་མངའ་བའི་ཡེ་ཤེས་ཅན་ཏེ།
en: The blessed buddhas possess wisdom that is not obscured in any way.

source: རིགས་ཀྱི་བུ་ཁྱེད་གཉིས་ཀྱིས་ཆོས་ཡང་དག་པར་བརྗོད་པ་དང་འཐུན་པར་བྱས་སོ། །
en: Children of good family, your discourse on the Dharma is in accord.

source: རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གང་ཅི་སྨྲ་བ་དང་། ཀུན་སྨྲ་བ་དེ་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་བརླབས་སུ་རིག་པར་བྱའོ། །
en: Children of good family, understand that anything that bodhisattvas say, everything they say, is blessed by the Thus-Gone One.

source: རིགས་ཀྱི་བུ་དག་ལེགས་སོ་ལེགས་སོ། །
en: Children of good family, this is excellent! Excellent!

source: ཇི་ལྟར་ཁྱོད་གཉིས་ཀྱིས་བྱས་པ་དེ་བཞིན་དུ་ཆོས་ཡང་དག་པར་བརྗོད་པར་བྱའོ། །
en: Discourses on the Dharma should be just like yours.

source: རིགས་ཀྱི་བུ་ཁྱེད་གཉིས་ཀྱིས་ཆོས་ཡང་དག་པར་བརྗོད་པ་འདིས་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱས་སོ། །
en: Children of good family, with this discourse on the Dharma, you have done the Buddha’s work.

source: དེ་བཞིན་གཤེགས་པ་ཡང་ཁྱེད་གཉིས་ཀྱིས་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལ་རྗེས་སུ་ཡི་རང་ངོ་། །
en: The Thus-Gone One rejoices in your discourse on the Dharma.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཅིའི་ཕྱིར་རྩོམ་པ་མེད་ཅེས་བྱ།
en: The venerable Śāriputra then addressed the bodhisattva Nirārambha: “Child of good family, why are you called ‘disengaged’?”

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ། བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་ཀྱི་མཐའ་ནི་ཤིན་ཏུ་བྱང་བ།
en: The bodhisattva Nirārambha said, “Honorable Śāradvatīputra, a bodhisattva’s activities of body, speech, and mind are pure.

source: བྱ་བ་ཐམས་ཅད་ལ་མི་ཆགས་པ། གང་ཡང་མི་ཚོལ་བ།
en: They are not attached to any action, and they do not seek anything.

source: ཅུང་ཟད་ཀྱང་སྤང་བར་མི་འདོད་པ། ཐོབ་པར་མི་འདོད་པ།
en: They do not wish to abandon the slightest thing, nor do they wish to attain.

source: འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་དེ་བཞིན་ཉིད་དུ་མཉམ་པར་མཐོང་བ། ཐ་མ་དང་། འབྲིང་དང་།
en: They regard that which arises in the past, future, and present to be equal in terms of their suchness, and they do not in any way observe phenomena as being inferior, average, or superior.

source: རབ་ཀྱི་ཆོས་ཅུང་ཟད་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེ་ནི་རྩོམ་པ་མེད་ཅེས་བྱའོ། །
en: That is what is meant by ‘disengaged.’

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་ཐམས་ཅད་ནི་གཟོད་མ་ནས་མེད་པར་གྱུར་ན་རྩོམ་པ་མེད་པའོ། །
en: “Honorable Śāradvatīputra, because phenomena are nonexistent from the beginning, they are disengaged.

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་ཆོས་འགའ་ཞིག་གཟོད་མ་ནས་ཡོད་པར་གྱུར་ན་ནི་དེ་བརྩམ་པར་བྱ་ན་ཆོས་གང་ཡང་གཟོད་མ་ནས་ཡོད་པ་མ་ཡིན་ཏེ།
en: Honorable Śāradvatīputra, if a phenomenon were to exist from the beginning it could be engaged.

source: གཟོད་མ་ནས་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་བརྩམས་པ་མེད་པའོ། །
en: But there is no phenomenon that exists from the beginning, and because phenomena do not exist from the beginning, there is nothing that is engaged.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་ར་དྭ་ཏིའི་བུས་སྨྲས་པ། དེ་ལྟ་ཡིན་ན་ཁྱོད་ཀྱིས་ཆོས་ཡང་དག་པར་བརྗོད་པ་དེ་ཇི་ལྟར་བྱས།
en: “If that is the case, how did you discourse on the Dharma?” asked the venerable Śāradvatīputra.

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ། བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བརྩམས་པ་མེད་པ་ཉིད་བདག་གིས་ཆོས་ཡང་དག་པར་བརྗོད་པ་བྱས་པའོ། །
en: “Honorable Śāradvatīputra,” replied the bodhisattva Nirārambha, “I gave a discourse on the Dharma as one who is himself disengaged.

source: བཙུན་པ་ཤཱ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: Honorable Śāradvatīputra, what do you think?

source: གང་ཁྱོད་ཀྱིས་དྲི་བ་དྲིས་པ་འདི་ཅི་ཁྱོད་ཀྱིས་འདི་བརྩམས་ཏེ་དྲིས་སམ། འོན་ཏེ་མ་བརྩམས་པར་དྲིས།
en: Were you engaged or disengaged when asking your question?

source: དེ་གལ་ཏེ་ཁྱོད་ཀྱིས་བརྩམས་ཏེ་དྲིས་ན་ནི་ཅི་ལ་རྟེན་ཏེ་བརྩམས།
en: If you were already engaged when you asked, what is the basis of your engagement?

source: གང་རྩོམ་པ་དང་བཅས་པ་དེ་ནི་འདྲི་བ་མ་ཡིན་ནོ། །རྩོམ་པ་ཡང་གཞན་ལ་འདྲི་བ་ཡང་གཞན་ཞེས་ནི་བྱ་བར་མི་འཐད་དོ། །
en: The question itself does not include engagement, and it would be illogical to claim that engagement is one thing and the question another.

source: ཅི་སྟེ་མ་བརྩམས་པར་དྲིས་ན་ནི་ཁྱོད་གཏམ་འདི་ལ་ཞུགས་པ་ཡིན་ནོ། །
en: If you asked without engagement, then you are participating in this discussion.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་ར་དྭ་ཏིའི་བུས་སྨྲས་པ། རིགས་ཀྱི་བུ་གང་བདག་དང་ཁྱོད་ཀྱི་བརྗོད་པ་དེ་ཇི་ལྟར་བལྟ་བར་བྱ།
en: “Child of good family, how should I look at this conversation we are having?” asked the venerable Śāradvatīputra.

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ། བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་སྒྱུ་མ་སྤྲུལ་པའི་བརྗོད་པ་ཇི་ལྟ་བར་དེ་བཞིན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་བརྗོད་པ་ཡང་དེ་ལྟར་བལྟ་བར་བྱའོ། །
en: “Honorable Śāradvatīputra,” replied the bodhisattva Nirārambha, “it is like this: Consider the statements made by a bodhisattva who remains in suchness, in the expanse of phenomena, to be analogous to the statements made by a magical illusion.

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྒྱུ་མ་སྤྲུལ་པ་ལ་ནི་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་མེད་དོ། །
en: Honorable Śāradvatīputra, there is no mind and no mental phenomena in a magical illusion.

source: གང་ལ་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་མེད་པ་དེ་ཅི་ཞིག་རྩོམ་པར་འགྱུར།
en: How could there be engagement present in something that lacks mind and mental phenomena?

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྒྱུ་མ་མཁན་གྱི་འཕེན་པའི་དབང་གིས་སྒྱུ་མ་སྤྲུལ་པའི་བརྗོད་པ་འབྱུང་བ་ཇི་ལྟ་བར་དེ་བཞིན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་བརྗོད་པ་ཡང་དེ་ལྟར་བལྟ་བར་བྱའོ། །
en: Honorable Śāradvatīputra, consider the statements of a bodhisattva who remains in suchness, in the expanse of phenomena, to be like the statements of a magical illusion under the control of a skilled magician.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ། རིགས་ཀྱི་བུ་སྒྱུ་མ་སྤྲུལ་པ་ནི་བྱུང་བ་ཡང་མ་ཡིན། མ་བྱུང་བ་ཡང་མ་ཡིན་ན། ཅི་ཁྱོད་ཀྱང་བྱུང་བ་ཡང་མ་ཡིན། མ་བྱུང་བ་ཡང་མ་ཡིན་ནམ།
en: “Child of good family, if the magical illusion neither arises nor does not arise, do you also neither arise nor not arise?”

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ།
en: asked the venerable Śāradvatīputra.

source: བཙུན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རབ་ཏུ་མ་བཤད་དམ།
en: “Honorable Śāradvatīputra,” replied the bodhisattva Nirārambha, “when he attained perfect buddhahood, did the Thus-Gone One not say that all phenomena are like illusions?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ།
en: “Child of good family, yes, it was like that,” said the venerable Śāriputra.

source: དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རབ་ཏུ་བཤད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ།
en: “When he attained perfect buddhahood, the Thus-Gone One said that all phenomena are like illusions.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཇི་ལྟར་སྒྱུ་མ་བྱུང་བ་ཡང་མ་ཡིན། མ་བྱུང་བ་ཡང་མ་ཡིན་པ་དེ་བཞིན་དུ་སྒྱུ་མ་ལྟ་བུའི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱང་བྱུང་བ་ཡང་མ་ཡིན།
en: The bodhisattva Nirārambha continued, “Honorable Śāradvatīputra, just as a magical illusion neither arises nor does not arise, should you not recognize that all illusory phenomena likewise neither arise nor do not arise?

source: མ་བྱུང་བ་ཡང་མ་ཡིན་པར་བལྟ་བར་མི་བྱའམ། བཙུན་པ་ཤཱ་རིའི་བུ་གལ་ཏེ་བྱུང་བའམ། མ་བྱུང་བ་ཞིག་ཡོད་ན་ནི་སྒྱུ་མ་ལྟ་བུར་ཡང་བསྟན་པར་མི་འགྱུར་རོ། །
en: Honorable Śāradvatīputra, if there existed something that arose or did not arise, they would not have been taught to be illusory.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁྱོད་སུའི་ཆེད་དུ་སྤྱོད།
en: “Child of good family, on whose behalf do you act?” asked the venerable Śāradvatīputra.

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་ཁོ་བོ་ནི་དོན་ནམ་དོན་མ་ཡིན་པའི་ཆེད་ལ་ཡང་མི་སྤྱོད་དོ། །
en: “Honorable Śāriputra,” replied the bodhisattva Nirārambha, “I do not act in pursuit of a purpose or of something meaningless.

source: གང་དོན་གྱི་ཆེད་ལ་སྤྱོད་པ་དེ་ནི་དམིགས་པ་ལ་སྤྱོད་པའོ། །དམིགས་པ་ལ་སྤྱོད་པ་དེ་ནི་སངས་རྒྱས་རྣམས་མཉེས་པར་བྱེད་པ་མ་ཡིན་ནོ། །
en: One who acts in pursuit of a purpose acts in relation to an object of reference, and one who acts in relation to an object of reference displeases the buddhas.

source: དམིགས་པ་ལ་སྤྱོད་པ་དེ་ནི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཡང་མི་འཐོབ་སྟེ།
en: One who acts in relation to an object of reference has not attained concordant acceptance.

source: བཟོད་པ་མེད་ན་སངས་རྒྱས་མཉེས་པར་བྱེད་པ་མ་ཡིན་ནོ། །
en: Lacking this acceptance, they displease the buddhas.

source: འོན་ཏེ་དོན་མ་ཡིན་པའི་ཆེད་ལ་སྤྱོད་ན་ནི་ལོག་པར་ལྟ་བ་ལ་སྤྱོད་པའོ། །
en: However, to act in pursuit of the meaningless is to act with wrong view.

source: ལོག་པར་ལྟ་བ་ནི་དོན་མེད་པའོ། །
en: Wrong views are meaningless.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ། རིགས་ཀྱི་བུ་གང་དག་དོན་དང་དོན་མ་ཡིན་པའི་ཆེད་ལ་མི་སྤྱོད་པ་དེ་དག་གང་དུ་སྤྱོད།
en: “Child of good family, what do those who act in pursuit of a purpose or of something meaningless act in pursuit of?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་གང་ལ་སྤྱོད་པ་དེ་ཉིད་ལ་དེ་དག་སྤྱོད་དོ། །
en: “Honorable Śāriputra, they act in pursuit of the very same things ordinary childish people pursue,” replied the bodhisattva Nirārambha.

source: སྨྲས་པ། རིགས་ཀྱི་བུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་གང་ལ་སྤྱོད།
en: The venerable Śāriputra asked, “Child of good family, what do ordinary childish people act in pursuit of?”

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་གང་ལ་སྤྱོད་པ་དེ་ཉིད་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱང་སྤྱོད་མོད་ཀྱི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་གང་ལ་སྤྱོད་པ་དེ་ཉིད་ལ་བདག་ཅག་ཀྱང་སྤྱོད་དོ་སྙམ་དུ་མི་སེམས་སོ། །
en: “Honorable Śāriputra,” replied the bodhisattva Nirārambha, “all ordinary childish people certainly act in pursuit of the very same things that the thus-gone, worthy, completely perfect buddhas pursue, but they do not think, ‘We act in pursuit of the very same things that the thus-gone, worthy, completely perfect buddhas pursue.’

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ། རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་གོ་སྐབས་མེད་པ་ནི།
en: “Child of good family,” countered the venerable Śāriputra, “ordinary childish people lack the circumstances to be within the scope of a buddha.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་གང་ལ་སྤྱོད་པ་དེ་ཉིད་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱང་སྤྱོད་དེ་འདི་ནི་འགལ་ལོ། །
en: How could ordinary childish people act in pursuit of the very same things that the thus-gone, worthy, completely perfect buddhas pursue? This is a contradiction.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཡུལ་ཤེས་སམ།
en: The bodhisattva Nirārambha asked, “Venerable Śāriputra, do you know the scope of a buddha?”

source: ཤཱ་རིའི་བུས་སྨྲས་པ། སྦྲང་བུ་འདྲ་བ་བདག་ལྟ་བུས་སངས་རྒྱས་ཀྱི་ཡུལ་ཤེས་པར་ག་ལ་ནུས་མོད་ཀྱི།
en: Śāriputra replied, “How could a bug like me know the scope of a buddha?

source: འོན་ཀྱང་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ལས་ཐོས་ནས་ནི་ཉན་ཐོས་རྣམས་ཀྱིས་ཀྱང་ཤེས་ཏེ།
en: And yet, child of good family, śrāvakas know by hearing about it from the Thus-Gone One.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཡུལ་ནི་མཐའ་ཡས་མུ་མེད་དོ། །
en: Child of good family, the scope of a buddha is infinite and without limit.

source: སངས་རྒྱས་ཀྱི་ཡུལ་ལས་རྣམ་པར་གྲོལ་བའི་ཡུལ་ནི་གང་ཡང་མེད་དོ། །
en: There is no scope that is outside the scope of a buddha.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་གལ་ཏེ་སངས་རྒྱས་ཀྱི་ཡུལ་ལས་རྣམ་པར་གྲོལ་བའི་ཡུལ་མེད་ན་ཅིའི་ཕྱིར་ཁྱོད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་གོ་སྐབས་མེད་ཅེས་སྨྲས།
en: The bodhisattva Nirārambha asked, “Honorable Śāriputra, if there is no scope that is outside the scope of a buddha, why did you say that ordinary childish people lack the circumstances to be within the scope of a buddha?”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ། དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་འཇིག་རྟེན་གྱི་ཡུལ་ལས་ཡང་དག་པར་འདས་པའོ། །
en: The venerable Śāriputra replied, “The thus-gone ones transcend the scope of the world.

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་འཇིག་རྟེན་ཉིད་ནི་སྤྱོད་པའོ། །
en: Ordinary childish people act in a worldly manner.

source: དེ་བས་ན་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་གོ་སྐབས་མེད་དོ། །
en: Thus, ordinary childish people lack the circumstances to be within the scope of a buddha.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: The bodhisattva Nirārambha then asked, “Venerable Śāriputra, what do you think?

source: དེ་བཞིན་གཤེགས་པས་ཅི་ཞིག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་གང་དུ་བཞུགས་ནས་སུའི་དོན་མཛད།
en: Whose purpose did the Thus-Gone One serve after he had reached perfect awakening?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་གང་དེ་བཞིན་གཤེགས་པས་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པའི་ཆོས་གང་ཡང་མེད་དེ།
en: “Child of good family,” replied the venerable Śāriputra, “there is not a single phenomenon that the Thus-Gone One has not perfectly awakened to.

source: ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ཀྱི་དོན་མཛད་ཅིང་འདུས་བྱས་ཉིད་ལ་སྤྱོད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ།
en: Having perfectly awakened to all phenomena, he served the purposes of beings and acted in a conditioned manner.”

source: གལ་ཏེ་དེ་ལྟར་ཤེས་ན་ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གྱི་ཡུལ་ལས་ཡང་དག་པར་འདས་ཞེས་སྨྲས།
en: “If that is your understanding, why did you say that the thus-gone ones transcend the scope of the world?” asked the bodhisattva Nirārambha.

source: དེ་ནི་གནས་བརྟན་ཤཱ་རིའི་བུས་ཁོང་དུ་མ་ཆུད་དོ། །
en: “The elder Śāriputra does not understand this.

source: བཙུན་པ་ཤཱ་རིའི་བུ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་རྣམས་འཇིག་རྟེན་གྱི་ཡུལ་ལས་ཡང་དག་པར་འདས་སུ་ཟིན་ན་དེ་བཞིན་གཤེགས་པས་ཅི་ཞིག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཤིང་། གང་དུ་བཞུགས་ནས་སུའི་དོན་མཛད་པར་འགྱུར་ཏེ།
en: Honorable Śāriputra, if you assert that the thus-gone ones have transcended the scope of the world, did the Thus-Gone One awaken, and upon awakening, whose purpose did he serve?

source: འདི་ལ་གནས་བརྟན་ཤཱ་རིའི་བུས་སྨྲས་པ་ནི་ཤིན་ཏུ་ཉམས་སོ། །དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: What the elder Śāriputra said about this is exceedingly poor.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བདག་ནི་འདི་ལྟར་བྱང་ཆུབ་ཀྱི་སེམས་དང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལས་ཤིན་ཏུ་ཉམས་ཤིང་།
en: In response to that statement, the venerable Śāriputra told the bodhisattva great being Nirārambha, “Child of good family, I am exceedingly inferior in this way in terms of the mind set on awakening and omniscient wisdom.

source: ཉན་ཐོས་ཀྱི་ས་ལ་ཡང་ཤིན་ཏུ་གནས་པས་བདག་ནི་སྔོན་ནས་ཀྱང་ཉམས་སོ། །
en: Because I stubbornly remained at the level of a śrāvaka I have been inferior from the start.

source: རིགས་ཀྱི་བུ་བདག་ནི་ཁྱོད་ཀྱི་སྤོབས་པ་འདི་ལ་རྗེས་སུ་ཡི་རང་ངོ་། །
en: Child of good family, I rejoice in your confident eloquence.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཁྱོད་ཀྱི་སྤོབས་པ་འདི་ལྟ་བུ་ཐོབ་པར་གྱུར་ཅིག །
en: May all beings attain confident eloquence such as this!”

source: གཏམ་བརྗོད་པ་འདི་བསྟན་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཁྲི་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: When this discussion was finished, eighty thousand bodhisattvas attained acceptance of the nonarising of phenomena.

source: ལྷའི་བུ་དྲུག་སྟོང་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་དང་བྲལ་ཞིང་དྲི་མ་མེད་པར་རྣམ་པར་དག་གོ། །
en: For six thousand gods, dust fell away from the Dharma eye that sees phenomena, and they became stainless and pure.

source: དགེ་སློང་ལྔ་སྟོང་ནི་ཉན་ཐོས་ཀྱི་སེམས་ལས་ལོག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: Five thousand monks turned away from the perspective of a śrāvaka and generated the mind set upon unsurpassable, completely perfect awakening.

source: དེ་དག་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐ་དད་པ་རྣམས་སུ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ་ཞེས་ལུང་བསྟན་ཏོ། །
en: The Blessed One then predicted their perfect awakening in their respective buddhafields.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ན་གཟུང་བ་དང་འཛིན་པ་ལ་མཁས་པ་ལགས།
en: The bodhisattva great being Nirārambha then asked the Blessed One, “Blessed One, how does a bodhisattva great being become wise regarding the apprehended object and apprehending subject?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཐམས་ཅད་ཡང་དག་པར་ཤེས་པ་དེའི་ཚེ་གཟུང་བ་དང་འཛིན་པ་ལ་མཁས་པ་ཡིན་ནོ། །
en: The Blessed One replied, “When bodhisattvas perfectly know everything, they become wise regarding the apprehended object and apprehending subject.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཇི་ལྟར་ཤེས་པར་བགྱི།
en: “Blessed One, how should everything be known?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: asked the bodhisattva Nirārambha.
